Documents/Enhancements-Nov2017/DueDiligenceWebServices/ForAnalysis/FromPradeep/DDASiSprintSampleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:init="http://www.iconplc.com/InitiateDDASiSprintFindings/xsd/v3/initiateDDASiSprintFindingsMsg" xmlns:edh="http://edh.esb.iconplc.com">
   <soapenv:Header/>
   <soapenv:Body>
      <init:DueDiligenceiSprintRequest>
         <init:header>
            <init:sender>sri</init:sender>
            <init:timestamp>2017-08-20T11:06:25.000Z</init:timestamp>
            <init:message_id>SuriTest1</init:message_id>
         </init:header>
         <!--Optional:-->
         <init:DDResults>
            <edh:project>
               <edh:projectNumber>9002</edh:projectNumber>
               <!--Optional:-->
               <edh:sponsorProtocolNumber>2020202</edh:sponsorProtocolNumber>
            </edh:project>
            <edh:institutions>
               <!--Optional:-->
               <edh:checksCompleted>
                  <!--1 or more repetitions:-->
                  <edh:check>
                     <edh:name>institution world check</edh:name>
                     <!--Optional:-->
                     <edh:date>2018-02-01</edh:date>
                  </edh:check>
               </edh:checksCompleted>
               <edh:instituteComplianceIssue>true</edh:instituteComplianceIssue>
            </edh:institutions>
            <edh:investigatorResults>
               <!--1 or more repetitions:-->
               <edh:investigatorResult>
                  <edh:investigatorId>084823</edh:investigatorId>
                  <!--Optional:-->
                  <edh:memberId></edh:memberId>
                  <edh:firstName>Leila</edh:firstName>
                  <!--Optional:-->
                  <edh:middleName>AA</edh:middleName>
                  <edh:lastName>Vaalavirta</edh:lastName>
                  <edh:ddStatus>Available</edh:ddStatus>
                  <!--Optional:-->
                  <edh:ddCompletedDate>2018-03-09</edh:ddCompletedDate>
                  <!--Optional:-->
                  <edh:checksCompleted>
                     <!--1 or more repetitions:-->
                     <edh:check>
                        <edh:name>investigator world check</edh:name>
                        <!--Optional:-->
                        <edh:date>2018-03-09</edh:date>
                     </edh:check>
                  </edh:checksCompleted>
                  <!--Optional:-->
                  <edh:dmc9002CheckDate>2018-03-09</edh:dmc9002CheckDate>
                  <!--Optional:-->
                  <edh:dmc9002Exclusion>Exclusion</edh:dmc9002Exclusion>
                  <!--Optional:-->
                  <edh:ddFindings>
                     <!--1 or more repetitions:-->
                     <edh:finding>
                        <edh:date>2018-03-09</edh:date>
                       
                        <edh:comment>test 09thMarch </edh:comment>
                     </edh:finding>
                  </edh:ddFindings>
               </edh:investigatorResult>
            </edh:investigatorResults>
         </init:DDResults>
      </init:DueDiligenceiSprintRequest>
   </soapenv:Body>
</soapenv:Envelope>